app/controllers/posts_controller.rb

INSERT INTO "posts" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", ""], ["created_at", 2017-02-10 03:01:47 UTC], ["updated_at", 2017-02-10 03:01:47 UTC]]
---
  def create
    @post = Post.new(permit_post)
    if @post.save